package controllers

import (
	"github.com/astaxie/beego"
	"xiaomatv.cn/services"
)

/**
 ***********************************************************
 **作者：zwx<lockfeel1215@gmail.com>
 **---------------------------------------------------------
 **时间：2018.08.13
 **---------------------------------------------------------
 **描述：用户互动类
 ***********************************************************
 */

 type Interactive struct {
	 /*继承beego*/
	 beego.Controller
	 Serv services.ConnotationSerivce `inject:""`
 }
/**
 ************************************************************
 **方法::Interactive::GetComments
 **----------------------------------------------------------
 **描述::获取主题评论列表
 **----------------------------------------------------------
 **参数:
 **param1:in-- Int : user_id    :: 用户ID
 **param2:in-- Int : page_num   :: 分页数量
 **param3:in-- Int : page_size  :: 分页大小
 **param4:in-- Int : type		:: 请求类型
 **param5:in-- Int : theme_id   :: 主题ID
 **----------------------------------------------------------
 **返回：
 **return:out--  JSON ：data  :: JSON对象
 **----------------------------------------------------------
 **日期:2018.08.15  Add by zwx
 ************************************************************
 */
 func (a *Interactive) GetComments() {

 }
/**
 ************************************************************
 **方法::Interactive::GetThumbs
 **----------------------------------------------------------
 **描述::获取主题点赞列表
 **----------------------------------------------------------
 **参数:
 **param1:in-- Int : user_id    :: 用户ID
 **param2:in-- Int : page_num   :: 分页数量
 **param3:in-- Int : page_size  :: 分页大小
 **param4:in-- Int : type		:: 请求类型
 **param5:in-- Int : theme_id   :: 主题ID
 **----------------------------------------------------------
 **返回：
 **return:out--  JSON ：data  :: JSON对象
 **----------------------------------------------------------
 **日期:2018.08.15  Add by zwx
 ************************************************************
 */
 func (a *Interactive) GetThumbs() {

 }
/**
 ************************************************************
 **方法::Interactive::GetFollowUsers
 **----------------------------------------------------------
 **描述::获取用户关注列表
 **----------------------------------------------------------
 **参数:
 **param1:in-- Int : user_id    :: 用户ID
 **param2:in-- Int : page_num   :: 分页数量
 **param3:in-- Int : page_size  :: 分页大小
 **param4:in-- Int : type		:: 请求类型
 **----------------------------------------------------------
 **返回：
 **return:out--  JSON ：data  :: JSON对象
 **----------------------------------------------------------
 **日期:2018.08.15  Add by zwx
 ************************************************************
 */
 func (a *Interactive) GetFollowUsers() {

 }
/**
 ************************************************************
 **方法::Interactive::GetShareUsers
 **----------------------------------------------------------
 **描述::获取主题收藏用户列表
 **----------------------------------------------------------
 **参数:
 **param1:in-- Int : user_id    :: 用户ID
 **param2:in-- Int : page_num   :: 分页数量
 **param3:in-- Int : page_size  :: 分页大小
 **param4:in-- Int : type		:: 请求类型
 **param5:in-- Int : theme_id   :: 主题ID
 **----------------------------------------------------------
 **返回：
 **return:out--  JSON ：data  :: JSON对象
 **----------------------------------------------------------
 **日期:2018.08.15  Add by zwx
 ************************************************************
 */
 func (a *Interactive) GetShareUsers() {

 }
/**
 ************************************************************
 **方法::Interactive::GetCollectUsers
 **----------------------------------------------------------
 **描述::获取用户收藏列表
 **----------------------------------------------------------
 **参数:
 **param1:in-- Int : user_id    :: 用户ID
 **param2:in-- Int : page_num   :: 分页数量
 **param3:in-- Int : page_size  :: 分页大小
 **param4:in-- Int : type		:: 请求类型
 **param5:in-- Int : theme_id   :: 主题ID
 **----------------------------------------------------------
 **返回：
 **return:out--  JSON ：data  :: JSON对象
 **----------------------------------------------------------
 **日期:2018.08.15  Add by zwx
 ************************************************************
 */
 func (a *Interactive) GetCollectUsers() {

 }
/**
 ************************************************************
 **方法::Interactive::GetThumbCommentUsers
 **----------------------------------------------------------
 **描述::获取评论点赞列表
 **----------------------------------------------------------
 **参数:
 **param1:in-- Int : user_id    :: 用户ID
 **param2:in-- Int : page_num   :: 分页数量
 **param3:in-- Int : page_size  :: 分页大小
 **param4:in-- Int : type		:: 请求类型
 **param5:in-- Int : comment_id :: 评论ID
 **param6:in-- Int : theme_id   :: 主题ID
 **----------------------------------------------------------
 **返回：
 **return:out--  JSON ：data  :: JSON对象
 **----------------------------------------------------------
 **日期:2018.08.15  Add by zwx
 ************************************************************
 */
 func (a *Interactive) GetThumbCommentUsers() {

 }